app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT * FROM `users` WHERE (`users`.`id` = 137)
SELECT * FROM `microposts` WHERE (`microposts`.user_id = 1) ORDER BY created_at DESC LIMIT 0, 30
SELECT count(*) AS count_all FROM `microposts` WHERE (`microposts`.user_id = 1)

  def create
  	@user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `encrypted_password`, `salt`, `remember_token`, `admin`) VALUES('Example User', 'user@example.com', '2015-08-06 06:22:32', '2015-08-06 06:22:32', '7172ae889d17373648bee8261c7cea17e3afb977cee14c34171cf27c59c3742c', '96f51186ea0ef4c4d5681f3a49375520999a63fe943b1189942597f360497d22', NULL, 0)

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM `users` LIMIT 0, 30